IDEA StatiCa Open Model
Polygon3D.Points Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of polygon points
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<Point3D> Points { get; set; }
Public Property Points As List(Of Point3D)
	Get
	Set
public:
property List<Point3D^>^ Points {
	List<Point3D^>^ get ();
	void set (List<Point3D^>^ value);
}
Property Value
Type: List<Point3D>
See Also
Reference
Polygon3D Class
IdeaRS.OpenModel.Geometry3D Namespace